## Plan Result (finops_reporting_sbox)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_logic_app_workflow.logic_app_workflow
  * azurerm_resource_group.finops_reporting_rg
  * azurerm_resource_group_template_deployment.logic_app_deployment
  * azurerm_role_assignment.storage_table_contributor
  * azurerm_storage_table.finops_reporting_storage_table
  * module.finops_reporting_storage_account.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_logic_app_workflow.logic_app_workflow will be created
  + resource "azurerm_logic_app_workflow" "logic_app_workflow" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = false
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "finopsreportingincsbox"
      + resource_group_name             = "finops-reporting-sbox-rg"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/finops-reporting-incremental-export"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "2023-06-30"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_resource_group.finops_reporting_rg will be created
  + resource "azurerm_resource_group" "finops_reporting_rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "finops-reporting-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/finops-reporting-incremental-export"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "2023-06-30"
        }
    }

  # azurerm_resource_group_template_deployment.logic_app_deployment will be created
  + resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "logic-app-deployment"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + commonTags     = {
                  + value = "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJobWN0cy9maW5vcHMtcmVwb3J0aW5nLWluY3JlbWVudGFsLWV4cG9ydCIsImJ1c2luZXNzQXJlYSI6IkNyb3NzLUN1dHRpbmciLCJjcml0aWNhbGl0eSI6IkxvdyIsImVudmlyb25tZW50Ijoic2FuZGJveCIsImV4cGlyZXNBZnRlciI6IjIwMjMtMDYtMzAifQ=="
                }
              + location       = {
                  + value = "uksouth"
                }
              + logic_app_name = {
                  + value = "finopsreportingincsbox"
                }
            }
        )
      + resource_group_name = "finops-reporting-sbox-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/finops-reporting-incremental-export"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "2023-06-30"
        }
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + commonTags     = {
                      + defaultValue = ""
                      + type         = "string"
                    }
                  + location       = {
                      + defaultValue = ""
                      + type         = "string"
                    }
                  + logic_app_name = {
                      + defaultValue = ""
                      + type         = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-07-01"
                      + identity   = {
                          + type = "SystemAssigned"
                        }
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('logic_app_name')]"
                      + properties = {
                          + definition = {
                              + "$schema"      = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
                              + actions        = {
                                  + "Call REST API" = {
                                      + inputs = {
                                          + method = "GET"
                                          + uri    = ""
                                        }
                                      + type   = "Http"
                                    }
                                }
                              + contentVersion = "1.0.0.0"
                              + parameters     = {}
                              + triggers       = {
                                  + Recurrence = {
                                      + evaluatedRecurrence = {
                                          + frequency = "Hour"
                                          + interval  = 4
                                        }
                                      + recurrence          = {
                                          + frequency = "Hour"
                                          + interval  = 4
                                        }
                                      + type                = "Recurrence"
                                    }
                                }
                            }
                          + parameters = {}
                          + state      = "Disabled"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "Microsoft.Logic/workflows"
                    },
                ]
              + variables      = {
                  + tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # azurerm_role_assignment.storage_table_contributor will be created
  + resource "azurerm_role_assignment" "storage_table_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_table.finops_reporting_storage_table will be created
  + resource "azurerm_storage_table" "finops_reporting_storage_table" {
      + id                   = (known after apply)
      + name                 = "finopsreportingincsbox"
      + storage_account_name = "finopsreportingincsbox"
    }

  # module.finops_reporting_storage_account.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "finopsreportingincsbox"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "finops-reporting-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/finops-reporting-incremental-export"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "2023-06-30"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-00",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00",
            ]
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_logic_app_workflow.logic_app_workflow has been deleted
  - resource "azurerm_logic_app_workflow" "logic_app_workflow" {
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/finops-reporting-sbox-rg/providers/Microsoft.Logic/workflows/finopsreportingincsbox"
      - name                            = "finopsreportingincsbox" -> null
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/finops-reporting-incremental-export"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-06-30"
        }
        # (10 unchanged attributes hidden)

      - identity {
          - principal_id = "f15f0ed0-5b0f-481e-9390-2fc7b068992a" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_resource_group.finops_reporting_rg has been deleted
  - resource "azurerm_resource_group" "finops_reporting_rg" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/finops-reporting-sbox-rg"
      - location = "uksouth" -> null
      - name     = "finops-reporting-sbox-rg" -> null
        tags     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/finops-reporting-incremental-export"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-06-30"
        }
    }

  # module.finops_reporting_storage_account.azurerm_storage_account.storage_account has been deleted
  - resource "azurerm_storage_account" "storage_account" {
      - id                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/finops-reporting-sbox-rg/providers/Microsoft.Storage/storageAccounts/finopsreportingincsbox" -> null
        name                              = "finopsreportingincsbox"
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://finopsreportingincsbox.blob.core.windows.net/" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_file_endpoint             = "https://finopsreportingincsbox.file.core.windows.net/" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://finopsreportingincsbox.queue.core.windows.net/" -> null
      - primary_table_endpoint            = "https://finopsreportingincsbox.table.core.windows.net/" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/finops-reporting-incremental-export"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-06-30"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":14,"Program":"tfcmt","SHA1":"","Target":"finops_reporting_sbox","Vars":{}} -->